Revit 2027 API
Part.GetFaceOffset Method
 Get face offset of the given part face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFaceOffset(
	Face face
)
Public Function GetFaceOffset (
	face As Face
) As Double
public:
double GetFaceOffset(
	Face^ face
)
member GetFaceOffset :
        face : Face -> float
Parameters
face Face
 The face whose offset is required.
Return Value
Double
 Returns the value of the offset.
Exceptions
Exception | Condition
ArgumentException |  face does not belong to the part.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace